[
    {
        "Id": 1,
        "Name": "Cozy Winter Sweater",
        "Description": "Stay warm and stylish this winter with our cozy knit sweater. It's perfect for chilly days and features a classic design that goes well with any outfit.",
        "CategoryId": 1,
        "Price": 59.99
    },
    {
        "Id": 2,
        "Name": "Classic Denim Jeans",
        "Description": "A wardrobe essential! Our classic denim jeans offer a timeless look and a comfortable fit. Whether you're dressing up or going casual, these jeans have you covered.",
        "CategoryId": 3,
        "Price": 39.99
    },
    {
        "Id": 3,
        "Name": "Elegant Evening Dress",
        "Description": "Dazzle at your next special occasion with our elegant evening dress. This gown features intricate lace details and a flattering silhouette that's sure to turn heads.",
        "CategoryId": 7,
        "Price": 129.99
    },
    {
        "Id": 4,
        "Name": "Casual Weekend T-Shirt",
        "Description": "Spend your weekends in comfort and style with our casual t-shirt. It's made from soft, breathable fabric and comes in various colors to suit your mood.",
        "CategoryId": 1,
        "Price": 19.99
    },
    {
        "Id": 5,
        "Name": "Sporty Jogging Pants",
        "Description": "Get active in our sporty jogging pants. These pants are designed for maximum comfort during workouts and leisure activities. Stay on the move with confidence.",
        "CategoryId": 3,
        "Price": 29.99
    },
    {
        "Id": 6,
        "Name": "Chic Leather Jacket",
        "Description": "Achieve a timeless, edgy look with our chic leather jacket. Crafted from high-quality leather, it's a versatile piece that adds an element of sophistication to any outfit.",
        "CategoryId": 2,
        "Price": 79.99
    },
    {
        "Id": 7,
        "Name": "Summer Beach Shorts",
        "Description": "Ready for some fun in the sun? Our summer beach shorts are perfect for beach days and pool parties. They come in vibrant colors and are quick-drying for your comfort.",
        "CategoryId": 3,
        "Price": 24.99
    },
    {
        "Id": 8,
        "Name": "Formal Business Suit",
        "Description": "Make a professional statement with our formal business suit. It's tailored to perfection, exuding confidence and style. Ideal for meetings and special events.",
        "CategoryId": 9,
        "Price": 199.99
    }
]